import { DataTableOptions } from '@x-angular/data-table'

export type data = {
  _id: string
  title: string
  content: string
  category: string
  imagesList: never[]
  tags: string[]
  user_id: string
  isPublished: boolean
  isApproved: boolean
  isRejected: boolean
  rejectionReason: null
  likes: null
  createdAt: string
  updatedAt: string
  post_type: string
}
export const CONFIGURATION: DataTableOptions = {
  columns: [
    'title',
    'content',
    'category',
    'isPublished',
    'isApproved',
    'isRejected',
    'rejectionReason',
    'likes',
    'createdAt',
    'updatedAt',
    'post_type',
  ],
  headerOptions: {
    title: { displayProp: 'Title' },
    content: { displayProp: 'Content' },
    category:{displayProp:'Category'},
    isPublished: { displayProp: 'Published Status' },
    isApproved: { displayProp: 'Approval Status' },
    isRejected: { displayProp: 'Rejected Status' },
    rejectionReason: { displayProp: 'Reason for rejection' },
    post_type: { displayProp: 'Post Type' },
    likes: { displayProp: 'Likes' },
    createdAt: { displayProp: 'Created Date' },
    updatedAt: { displayProp: 'Updated Date' },
  },
  paginationOptions: {
    pageSize: 5,
    pageSizeOptions: [5, 10, 20, 50, 100],
    pageIndex: 1,
  },
  filterOptions: {
    columns: [
      'title',
      'content',
      'category',
      'isPublished',
      'isApproved',
      'isRejected',
      'rejectionReason',
      'likes',
      'createdAt',
      'updatedAt',
      'post_type',
    ],
  },
}

// const data = [
//   {
//     _id: '671c8d6c3178858e9e6cad99',
//     title:
//       ' TCS-4 Campus in Vizag: విశాఖలో క్యాంపస్ ఏర్పాటు.. ప్లాన్ మార్చిన టీసీఎస్!.. అక్కడేనా?',
//     content:
//       'ఏపీలోని యువతకు శుభవార్త.. విశాఖపట్నంలో టీసీఎస్ క్యాంపస్ ఏర్పాటుకు వడివడిగా అడుగులు పడుతున్నాయి. టాటా సన్స్ బోర్డు ఛైర్మన్ నటరాజన్ చంద్రశేఖరన్‌తో భేటీ అనంతరం.. ఏపీలో టీసీఎస్ క్యాంపస్ ఏర్పాటు చేయనున్నట్లు ఏపీ ఐటీశాఖ మంత్రి నారా లోకేష్ ప్రకటించిన సంగతి తెలిసిందే. అనంతరం 100 రోజుల్లోనే విశాఖపట్నంలో టీసీఎస్ క్యాంపస్‌కు శంకుస్థాపన చేస్తామని.. నారా లోకేష్ ఇటీవల మరోసారి స్పష్టం చేశారు. ఈ నేపథ్యంలో వైజాగ్‌లో టీసీఎస్ క్యాంపస్ ఏర్పాటు కోసం ప్రయత్నాలు వేగంగా జరుగుతున్నాయి. అయితే వేగంగా టీసీఎస్ క్యాంపస్ ఏర్పాటు చేస్తామని.. కార్యకలాపాలు ప్రారంభిస్తామని నారా లోకేష్ చెప్తున్నారు. ఈ నేపథ్యంలో ఇప్పటికిప్పుడు విశాఖపట్నంలో సొంతంగా భవనాలు నిర్మించడం కష్టం కావున టీసీఎస్ మరో ప్లాన్ అమలు చేస్తున్నట్లు తెలిసింది.\r\n\r\nసొంతంగా భవనాల నిర్మాణం ఇప్పట్లో సాధ్యమయ్యేది కాదు కావున.. భవనాలను అద్దెకు తీసుకోవాలని టీసీఎస్ వర్గాలు భావిస్తున్నట్లు తెలిసింది. ఇందుకోసం పలు ప్రాంతాలను పరిశీలిస్తున్నట్లు సమాచారం. విశాఖలో క్యాంపస్ ఏర్పాటు కోసం లక్ష చదరపు అడుగుల విస్తీర్ణంలో ఆఫీస్ స్పేస్ కావాలని టీసీఎస్ భావిస్తోంది. ఈ నేపథ్యంలోనే రుషికొండ ఐటీ హిల్స్‌లోని మిలీనియం టవర్స్‌లో క్యాంపస్ ఏర్పాటుపై ఆలోచనలు చేస్తున్నట్లు తెలిసింది. ఇది కాకుండా మరో రెండు ప్రైవేటు భవనాలు అద్దె తీసుకునే విషయంపైనా ఆలోచనలు చేస్తున్నట్లు సమాచారం. రుషికొండ ఐటీహిల్స్ మిలీనియం టవర్స్‌లో ఓ భవనం ఖాళీగా ఉంది. ఇదైతే టీసీఎస్ క్యాంపస్ ఏర్పాటుకు సరిగ్గా సరిపోతుందనే ఆలోచన ఉంది',
//     category: 'Technology',
//     imagesList: [],
//     tags: ['#sports', '#cricket', '#News'],
//     user_id: '671c8d6c3178858e9e6cad9a',
//     isPublished: true,
//     isApproved: true,
//     isRejected: false,
//     rejectionReason: null,
//     likes: null,
//     createdAt: '2024-10-26T06:34:20.202Z',
//     updatedAt: '2024-10-26T06:34:20.202Z',
//     post_type: 'artical',
//   },
//   {
//     _id: '671c8d6c3178858e9e6cad9b',
//     title:
//       ' TCS-5 Campus in Vizag: విశాఖలో క్యాంపస్ ఏర్పాటు.. ప్లాన్ మార్చిన టీసీఎస్!.. అక్కడేనా?',
//     content:
//       'ఏపీలోని యువతకు శుభవార్త.. విశాఖపట్నంలో టీసీఎస్ క్యాంపస్ ఏర్పాటుకు వడివడిగా అడుగులు పడుతున్నాయి. టాటా సన్స్ బోర్డు ఛైర్మన్ నటరాజన్ చంద్రశేఖరన్‌తో భేటీ అనంతరం.. ఏపీలో టీసీఎస్ క్యాంపస్ ఏర్పాటు చేయనున్నట్లు ఏపీ ఐటీశాఖ మంత్రి నారా లోకేష్ ప్రకటించిన సంగతి తెలిసిందే. అనంతరం 100 రోజుల్లోనే విశాఖపట్నంలో టీసీఎస్ క్యాంపస్‌కు శంకుస్థాపన చేస్తామని.. నారా లోకేష్ ఇటీవల మరోసారి స్పష్టం చేశారు. ఈ నేపథ్యంలో వైజాగ్‌లో టీసీఎస్ క్యాంపస్ ఏర్పాటు కోసం ప్రయత్నాలు వేగంగా జరుగుతున్నాయి. అయితే వేగంగా టీసీఎస్ క్యాంపస్ ఏర్పాటు చేస్తామని.. కార్యకలాపాలు ప్రారంభిస్తామని నారా లోకేష్ చెప్తున్నారు. ఈ నేపథ్యంలో ఇప్పటికిప్పుడు విశాఖపట్నంలో సొంతంగా భవనాలు నిర్మించడం కష్టం కావున టీసీఎస్ మరో ప్లాన్ అమలు చేస్తున్నట్లు తెలిసింది.\r\n\r\nసొంతంగా భవనాల నిర్మాణం ఇప్పట్లో సాధ్యమయ్యేది కాదు కావున.. భవనాలను అద్దెకు తీసుకోవాలని టీసీఎస్ వర్గాలు భావిస్తున్నట్లు తెలిసింది. ఇందుకోసం పలు ప్రాంతాలను పరిశీలిస్తున్నట్లు సమాచారం. విశాఖలో క్యాంపస్ ఏర్పాటు కోసం లక్ష చదరపు అడుగుల విస్తీర్ణంలో ఆఫీస్ స్పేస్ కావాలని టీసీఎస్ భావిస్తోంది. ఈ నేపథ్యంలోనే రుషికొండ ఐటీ హిల్స్‌లోని మిలీనియం టవర్స్‌లో క్యాంపస్ ఏర్పాటుపై ఆలోచనలు చేస్తున్నట్లు తెలిసింది. ఇది కాకుండా మరో రెండు ప్రైవేటు భవనాలు అద్దె తీసుకునే విషయంపైనా ఆలోచనలు చేస్తున్నట్లు సమాచారం. రుషికొండ ఐటీహిల్స్ మిలీనియం టవర్స్‌లో ఓ భవనం ఖాళీగా ఉంది. ఇదైతే టీసీఎస్ క్యాంపస్ ఏర్పాటుకు సరిగ్గా సరిపోతుందనే ఆలోచన ఉంది',
//     category: 'Technology',
//     imagesList: [],
//     tags: ['#sports', '#cricket', '#News'],
//     user_id: '671c8d6c3178858e9e6cad9c',
//     isPublished: true,
//     isApproved: true,
//     isRejected: false,
//     rejectionReason: null,
//     likes: null,
//     createdAt: '2024-10-26T06:34:20.204Z',
//     updatedAt: '2024-10-26T06:34:20.204Z',
//     post_type: 'artical',
//   },
//   {
//     _id: '671c8d6c3178858e9e6cad9d',
//     title:
//       ' TCS-6 Campus in Vizag: విశాఖలో క్యాంపస్ ఏర్పాటు.. ప్లాన్ మార్చిన టీసీఎస్!.. అక్కడేనా?',
//     content:
//       'ఏపీలోని యువతకు శుభవార్త.. విశాఖపట్నంలో టీసీఎస్ క్యాంపస్ ఏర్పాటుకు వడివడిగా అడుగులు పడుతున్నాయి. టాటా సన్స్ బోర్డు ఛైర్మన్ నటరాజన్ చంద్రశేఖరన్‌తో భేటీ అనంతరం.. ఏపీలో టీసీఎస్ క్యాంపస్ ఏర్పాటు చేయనున్నట్లు ఏపీ ఐటీశాఖ మంత్రి నారా లోకేష్ ప్రకటించిన సంగతి తెలిసిందే. అనంతరం 100 రోజుల్లోనే విశాఖపట్నంలో టీసీఎస్ క్యాంపస్‌కు శంకుస్థాపన చేస్తామని.. నారా లోకేష్ ఇటీవల మరోసారి స్పష్టం చేశారు. ఈ నేపథ్యంలో వైజాగ్‌లో టీసీఎస్ క్యాంపస్ ఏర్పాటు కోసం ప్రయత్నాలు వేగంగా జరుగుతున్నాయి. అయితే వేగంగా టీసీఎస్ క్యాంపస్ ఏర్పాటు చేస్తామని.. కార్యకలాపాలు ప్రారంభిస్తామని నారా లోకేష్ చెప్తున్నారు. ఈ నేపథ్యంలో ఇప్పటికిప్పుడు విశాఖపట్నంలో సొంతంగా భవనాలు నిర్మించడం కష్టం కావున టీసీఎస్ మరో ప్లాన్ అమలు చేస్తున్నట్లు తెలిసింది.\r\n\r\nసొంతంగా భవనాల నిర్మాణం ఇప్పట్లో సాధ్యమయ్యేది కాదు కావున.. భవనాలను అద్దెకు తీసుకోవాలని టీసీఎస్ వర్గాలు భావిస్తున్నట్లు తెలిసింది. ఇందుకోసం పలు ప్రాంతాలను పరిశీలిస్తున్నట్లు సమాచారం. విశాఖలో క్యాంపస్ ఏర్పాటు కోసం లక్ష చదరపు అడుగుల విస్తీర్ణంలో ఆఫీస్ స్పేస్ కావాలని టీసీఎస్ భావిస్తోంది. ఈ నేపథ్యంలోనే రుషికొండ ఐటీ హిల్స్‌లోని మిలీనియం టవర్స్‌లో క్యాంపస్ ఏర్పాటుపై ఆలోచనలు చేస్తున్నట్లు తెలిసింది. ఇది కాకుండా మరో రెండు ప్రైవేటు భవనాలు అద్దె తీసుకునే విషయంపైనా ఆలోచనలు చేస్తున్నట్లు సమాచారం. రుషికొండ ఐటీహిల్స్ మిలీనియం టవర్స్‌లో ఓ భవనం ఖాళీగా ఉంది. ఇదైతే టీసీఎస్ క్యాంపస్ ఏర్పాటుకు సరిగ్గా సరిపోతుందనే ఆలోచన ఉంది',
//     category: 'Technology',
//     imagesList: [],
//     tags: ['#sports', '#cricket', '#News'],
//     user_id: '671c8d6c3178858e9e6cad9e',
//     isPublished: true,
//     isApproved: true,
//     isRejected: false,
//     rejectionReason: null,
//     likes: null,
//     createdAt: '2024-10-26T06:34:20.205Z',
//     updatedAt: '2024-10-26T06:34:20.205Z',
//     post_type: 'artical',
//   },
//   {
//     _id: '671c8d6c3178858e9e6cad9f',
//     title:
//       ' TCS-7 Campus in Vizag: విశాఖలో క్యాంపస్ ఏర్పాటు.. ప్లాన్ మార్చిన టీసీఎస్!.. అక్కడేనా?',
//     content:
//       'ఏపీలోని యువతకు శుభవార్త.. విశాఖపట్నంలో టీసీఎస్ క్యాంపస్ ఏర్పాటుకు వడివడిగా అడుగులు పడుతున్నాయి. టాటా సన్స్ బోర్డు ఛైర్మన్ నటరాజన్ చంద్రశేఖరన్‌తో భేటీ అనంతరం.. ఏపీలో టీసీఎస్ క్యాంపస్ ఏర్పాటు చేయనున్నట్లు ఏపీ ఐటీశాఖ మంత్రి నారా లోకేష్ ప్రకటించిన సంగతి తెలిసిందే. అనంతరం 100 రోజుల్లోనే విశాఖపట్నంలో టీసీఎస్ క్యాంపస్‌కు శంకుస్థాపన చేస్తామని.. నారా లోకేష్ ఇటీవల మరోసారి స్పష్టం చేశారు. ఈ నేపథ్యంలో వైజాగ్‌లో టీసీఎస్ క్యాంపస్ ఏర్పాటు కోసం ప్రయత్నాలు వేగంగా జరుగుతున్నాయి. అయితే వేగంగా టీసీఎస్ క్యాంపస్ ఏర్పాటు చేస్తామని.. కార్యకలాపాలు ప్రారంభిస్తామని నారా లోకేష్ చెప్తున్నారు. ఈ నేపథ్యంలో ఇప్పటికిప్పుడు విశాఖపట్నంలో సొంతంగా భవనాలు నిర్మించడం కష్టం కావున టీసీఎస్ మరో ప్లాన్ అమలు చేస్తున్నట్లు తెలిసింది.\r\n\r\nసొంతంగా భవనాల నిర్మాణం ఇప్పట్లో సాధ్యమయ్యేది కాదు కావున.. భవనాలను అద్దెకు తీసుకోవాలని టీసీఎస్ వర్గాలు భావిస్తున్నట్లు తెలిసింది. ఇందుకోసం పలు ప్రాంతాలను పరిశీలిస్తున్నట్లు సమాచారం. విశాఖలో క్యాంపస్ ఏర్పాటు కోసం లక్ష చదరపు అడుగుల విస్తీర్ణంలో ఆఫీస్ స్పేస్ కావాలని టీసీఎస్ భావిస్తోంది. ఈ నేపథ్యంలోనే రుషికొండ ఐటీ హిల్స్‌లోని మిలీనియం టవర్స్‌లో క్యాంపస్ ఏర్పాటుపై ఆలోచనలు చేస్తున్నట్లు తెలిసింది. ఇది కాకుండా మరో రెండు ప్రైవేటు భవనాలు అద్దె తీసుకునే విషయంపైనా ఆలోచనలు చేస్తున్నట్లు సమాచారం. రుషికొండ ఐటీహిల్స్ మిలీనియం టవర్స్‌లో ఓ భవనం ఖాళీగా ఉంది. ఇదైతే టీసీఎస్ క్యాంపస్ ఏర్పాటుకు సరిగ్గా సరిపోతుందనే ఆలోచన ఉంది',
//     category: 'Technology',
//     imagesList: [],
//     tags: ['#sports', '#cricket', '#News'],
//     user_id: '671c8d6c3178858e9e6cada0',
//     isPublished: true,
//     isApproved: true,
//     isRejected: false,
//     rejectionReason: null,
//     likes: null,
//     createdAt: '2024-10-26T06:34:20.206Z',
//     updatedAt: '2024-10-26T06:34:20.206Z',
//     post_type: 'artical',
//   },
//   {
//     _id: '671c8d6c3178858e9e6cada1',
//     title:
//       ' TCS-8 Campus in Vizag: విశాఖలో క్యాంపస్ ఏర్పాటు.. ప్లాన్ మార్చిన టీసీఎస్!.. అక్కడేనా?',
//     content:
//       'ఏపీలోని యువతకు శుభవార్త.. విశాఖపట్నంలో టీసీఎస్ క్యాంపస్ ఏర్పాటుకు వడివడిగా అడుగులు పడుతున్నాయి. టాటా సన్స్ బోర్డు ఛైర్మన్ నటరాజన్ చంద్రశేఖరన్‌తో భేటీ అనంతరం.. ఏపీలో టీసీఎస్ క్యాంపస్ ఏర్పాటు చేయనున్నట్లు ఏపీ ఐటీశాఖ మంత్రి నారా లోకేష్ ప్రకటించిన సంగతి తెలిసిందే. అనంతరం 100 రోజుల్లోనే విశాఖపట్నంలో టీసీఎస్ క్యాంపస్‌కు శంకుస్థాపన చేస్తామని.. నారా లోకేష్ ఇటీవల మరోసారి స్పష్టం చేశారు. ఈ నేపథ్యంలో వైజాగ్‌లో టీసీఎస్ క్యాంపస్ ఏర్పాటు కోసం ప్రయత్నాలు వేగంగా జరుగుతున్నాయి. అయితే వేగంగా టీసీఎస్ క్యాంపస్ ఏర్పాటు చేస్తామని.. కార్యకలాపాలు ప్రారంభిస్తామని నారా లోకేష్ చెప్తున్నారు. ఈ నేపథ్యంలో ఇప్పటికిప్పుడు విశాఖపట్నంలో సొంతంగా భవనాలు నిర్మించడం కష్టం కావున టీసీఎస్ మరో ప్లాన్ అమలు చేస్తున్నట్లు తెలిసింది.\r\n\r\nసొంతంగా భవనాల నిర్మాణం ఇప్పట్లో సాధ్యమయ్యేది కాదు కావున.. భవనాలను అద్దెకు తీసుకోవాలని టీసీఎస్ వర్గాలు భావిస్తున్నట్లు తెలిసింది. ఇందుకోసం పలు ప్రాంతాలను పరిశీలిస్తున్నట్లు సమాచారం. విశాఖలో క్యాంపస్ ఏర్పాటు కోసం లక్ష చదరపు అడుగుల విస్తీర్ణంలో ఆఫీస్ స్పేస్ కావాలని టీసీఎస్ భావిస్తోంది. ఈ నేపథ్యంలోనే రుషికొండ ఐటీ హిల్స్‌లోని మిలీనియం టవర్స్‌లో క్యాంపస్ ఏర్పాటుపై ఆలోచనలు చేస్తున్నట్లు తెలిసింది. ఇది కాకుండా మరో రెండు ప్రైవేటు భవనాలు అద్దె తీసుకునే విషయంపైనా ఆలోచనలు చేస్తున్నట్లు సమాచారం. రుషికొండ ఐటీహిల్స్ మిలీనియం టవర్స్‌లో ఓ భవనం ఖాళీగా ఉంది. ఇదైతే టీసీఎస్ క్యాంపస్ ఏర్పాటుకు సరిగ్గా సరిపోతుందనే ఆలోచన ఉంది',
//     category: 'Technology',
//     imagesList: [],
//     tags: ['#sports', '#cricket', '#News'],
//     user_id: '671c8d6c3178858e9e6cada2',
//     isPublished: true,
//     isApproved: true,
//     isRejected: false,
//     rejectionReason: null,
//     likes: null,
//     createdAt: '2024-10-26T06:34:20.207Z',
//     updatedAt: '2024-10-26T06:34:20.207Z',
//     post_type: 'artical',
//   },
//   {
//     _id: '671c8d6c3178858e9e6cada3',
//     title:
//       ' TCS-9 Campus in Vizag: విశాఖలో క్యాంపస్ ఏర్పాటు.. ప్లాన్ మార్చిన టీసీఎస్!.. అక్కడేనా?',
//     content:
//       'ఏపీలోని యువతకు శుభవార్త.. విశాఖపట్నంలో టీసీఎస్ క్యాంపస్ ఏర్పాటుకు వడివడిగా అడుగులు పడుతున్నాయి. టాటా సన్స్ బోర్డు ఛైర్మన్ నటరాజన్ చంద్రశేఖరన్‌తో భేటీ అనంతరం.. ఏపీలో టీసీఎస్ క్యాంపస్ ఏర్పాటు చేయనున్నట్లు ఏపీ ఐటీశాఖ మంత్రి నారా లోకేష్ ప్రకటించిన సంగతి తెలిసిందే. అనంతరం 100 రోజుల్లోనే విశాఖపట్నంలో టీసీఎస్ క్యాంపస్‌కు శంకుస్థాపన చేస్తామని.. నారా లోకేష్ ఇటీవల మరోసారి స్పష్టం చేశారు. ఈ నేపథ్యంలో వైజాగ్‌లో టీసీఎస్ క్యాంపస్ ఏర్పాటు కోసం ప్రయత్నాలు వేగంగా జరుగుతున్నాయి. అయితే వేగంగా టీసీఎస్ క్యాంపస్ ఏర్పాటు చేస్తామని.. కార్యకలాపాలు ప్రారంభిస్తామని నారా లోకేష్ చెప్తున్నారు. ఈ నేపథ్యంలో ఇప్పటికిప్పుడు విశాఖపట్నంలో సొంతంగా భవనాలు నిర్మించడం కష్టం కావున టీసీఎస్ మరో ప్లాన్ అమలు చేస్తున్నట్లు తెలిసింది.\r\n\r\nసొంతంగా భవనాల నిర్మాణం ఇప్పట్లో సాధ్యమయ్యేది కాదు కావున.. భవనాలను అద్దెకు తీసుకోవాలని టీసీఎస్ వర్గాలు భావిస్తున్నట్లు తెలిసింది. ఇందుకోసం పలు ప్రాంతాలను పరిశీలిస్తున్నట్లు సమాచారం. విశాఖలో క్యాంపస్ ఏర్పాటు కోసం లక్ష చదరపు అడుగుల విస్తీర్ణంలో ఆఫీస్ స్పేస్ కావాలని టీసీఎస్ భావిస్తోంది. ఈ నేపథ్యంలోనే రుషికొండ ఐటీ హిల్స్‌లోని మిలీనియం టవర్స్‌లో క్యాంపస్ ఏర్పాటుపై ఆలోచనలు చేస్తున్నట్లు తెలిసింది. ఇది కాకుండా మరో రెండు ప్రైవేటు భవనాలు అద్దె తీసుకునే విషయంపైనా ఆలోచనలు చేస్తున్నట్లు సమాచారం. రుషికొండ ఐటీహిల్స్ మిలీనియం టవర్స్‌లో ఓ భవనం ఖాళీగా ఉంది. ఇదైతే టీసీఎస్ క్యాంపస్ ఏర్పాటుకు సరిగ్గా సరిపోతుందనే ఆలోచన ఉంది',
//     category: 'Technology',
//     imagesList: [],
//     tags: ['#sports', '#cricket', '#News'],
//     user_id: '671c8d6c3178858e9e6cada4',
//     isPublished: true,
//     isApproved: true,
//     isRejected: false,
//     rejectionReason: null,
//     likes: null,
//     createdAt: '2024-10-26T06:34:20.209Z',
//     updatedAt: '2024-10-26T06:34:20.209Z',
//     post_type: 'artical',
//   },
//   {
//     _id: '671c8d6c3178858e9e6cada5',
//     title:
//       ' TCS-10 Campus in Vizag: విశాఖలో క్యాంపస్ ఏర్పాటు.. ప్లాన్ మార్చిన టీసీఎస్!.. అక్కడేనా?',
//     content:
//       'ఏపీలోని యువతకు శుభవార్త.. విశాఖపట్నంలో టీసీఎస్ క్యాంపస్ ఏర్పాటుకు వడివడిగా అడుగులు పడుతున్నాయి. టాటా సన్స్ బోర్డు ఛైర్మన్ నటరాజన్ చంద్రశేఖరన్‌తో భేటీ అనంతరం.. ఏపీలో టీసీఎస్ క్యాంపస్ ఏర్పాటు చేయనున్నట్లు ఏపీ ఐటీశాఖ మంత్రి నారా లోకేష్ ప్రకటించిన సంగతి తెలిసిందే. అనంతరం 100 రోజుల్లోనే విశాఖపట్నంలో టీసీఎస్ క్యాంపస్‌కు శంకుస్థాపన చేస్తామని.. నారా లోకేష్ ఇటీవల మరోసారి స్పష్టం చేశారు. ఈ నేపథ్యంలో వైజాగ్‌లో టీసీఎస్ క్యాంపస్ ఏర్పాటు కోసం ప్రయత్నాలు వేగంగా జరుగుతున్నాయి. అయితే వేగంగా టీసీఎస్ క్యాంపస్ ఏర్పాటు చేస్తామని.. కార్యకలాపాలు ప్రారంభిస్తామని నారా లోకేష్ చెప్తున్నారు. ఈ నేపథ్యంలో ఇప్పటికిప్పుడు విశాఖపట్నంలో సొంతంగా భవనాలు నిర్మించడం కష్టం కావున టీసీఎస్ మరో ప్లాన్ అమలు చేస్తున్నట్లు తెలిసింది.\r\n\r\nసొంతంగా భవనాల నిర్మాణం ఇప్పట్లో సాధ్యమయ్యేది కాదు కావున.. భవనాలను అద్దెకు తీసుకోవాలని టీసీఎస్ వర్గాలు భావిస్తున్నట్లు తెలిసింది. ఇందుకోసం పలు ప్రాంతాలను పరిశీలిస్తున్నట్లు సమాచారం. విశాఖలో క్యాంపస్ ఏర్పాటు కోసం లక్ష చదరపు అడుగుల విస్తీర్ణంలో ఆఫీస్ స్పేస్ కావాలని టీసీఎస్ భావిస్తోంది. ఈ నేపథ్యంలోనే రుషికొండ ఐటీ హిల్స్‌లోని మిలీనియం టవర్స్‌లో క్యాంపస్ ఏర్పాటుపై ఆలోచనలు చేస్తున్నట్లు తెలిసింది. ఇది కాకుండా మరో రెండు ప్రైవేటు భవనాలు అద్దె తీసుకునే విషయంపైనా ఆలోచనలు చేస్తున్నట్లు సమాచారం. రుషికొండ ఐటీహిల్స్ మిలీనియం టవర్స్‌లో ఓ భవనం ఖాళీగా ఉంది. ఇదైతే టీసీఎస్ క్యాంపస్ ఏర్పాటుకు సరిగ్గా సరిపోతుందనే ఆలోచన ఉంది',
//     category: 'Technology',
//     imagesList: [],
//     tags: ['#sports', '#cricket', '#News'],
//     user_id: '671c8d6c3178858e9e6cada6',
//     isPublished: true,
//     isApproved: true,
//     isRejected: false,
//     rejectionReason: null,
//     likes: null,
//     createdAt: '2024-10-26T06:34:20.210Z',
//     updatedAt: '2024-10-26T06:34:20.210Z',
//     post_type: 'artical',
//   },
//   {
//     _id: '671c8d6c3178858e9e6cada7',
//     title:
//       ' TCS-11 Campus in Vizag: విశాఖలో క్యాంపస్ ఏర్పాటు.. ప్లాన్ మార్చిన టీసీఎస్!.. అక్కడేనా?',
//     content:
//       'ఏపీలోని యువతకు శుభవార్త.. విశాఖపట్నంలో టీసీఎస్ క్యాంపస్ ఏర్పాటుకు వడివడిగా అడుగులు పడుతున్నాయి. టాటా సన్స్ బోర్డు ఛైర్మన్ నటరాజన్ చంద్రశేఖరన్‌తో భేటీ అనంతరం.. ఏపీలో టీసీఎస్ క్యాంపస్ ఏర్పాటు చేయనున్నట్లు ఏపీ ఐటీశాఖ మంత్రి నారా లోకేష్ ప్రకటించిన సంగతి తెలిసిందే. అనంతరం 100 రోజుల్లోనే విశాఖపట్నంలో టీసీఎస్ క్యాంపస్‌కు శంకుస్థాపన చేస్తామని.. నారా లోకేష్ ఇటీవల మరోసారి స్పష్టం చేశారు. ఈ నేపథ్యంలో వైజాగ్‌లో టీసీఎస్ క్యాంపస్ ఏర్పాటు కోసం ప్రయత్నాలు వేగంగా జరుగుతున్నాయి. అయితే వేగంగా టీసీఎస్ క్యాంపస్ ఏర్పాటు చేస్తామని.. కార్యకలాపాలు ప్రారంభిస్తామని నారా లోకేష్ చెప్తున్నారు. ఈ నేపథ్యంలో ఇప్పటికిప్పుడు విశాఖపట్నంలో సొంతంగా భవనాలు నిర్మించడం కష్టం కావున టీసీఎస్ మరో ప్లాన్ అమలు చేస్తున్నట్లు తెలిసింది.\r\n\r\nసొంతంగా భవనాల నిర్మాణం ఇప్పట్లో సాధ్యమయ్యేది కాదు కావున.. భవనాలను అద్దెకు తీసుకోవాలని టీసీఎస్ వర్గాలు భావిస్తున్నట్లు తెలిసింది. ఇందుకోసం పలు ప్రాంతాలను పరిశీలిస్తున్నట్లు సమాచారం. విశాఖలో క్యాంపస్ ఏర్పాటు కోసం లక్ష చదరపు అడుగుల విస్తీర్ణంలో ఆఫీస్ స్పేస్ కావాలని టీసీఎస్ భావిస్తోంది. ఈ నేపథ్యంలోనే రుషికొండ ఐటీ హిల్స్‌లోని మిలీనియం టవర్స్‌లో క్యాంపస్ ఏర్పాటుపై ఆలోచనలు చేస్తున్నట్లు తెలిసింది. ఇది కాకుండా మరో రెండు ప్రైవేటు భవనాలు అద్దె తీసుకునే విషయంపైనా ఆలోచనలు చేస్తున్నట్లు సమాచారం. రుషికొండ ఐటీహిల్స్ మిలీనియం టవర్స్‌లో ఓ భవనం ఖాళీగా ఉంది. ఇదైతే టీసీఎస్ క్యాంపస్ ఏర్పాటుకు సరిగ్గా సరిపోతుందనే ఆలోచన ఉంది',
//     category: 'Technology',
//     imagesList: [],
//     tags: ['#sports', '#cricket', '#News'],
//     user_id: '671c8d6c3178858e9e6cada8',
//     isPublished: true,
//     isApproved: true,
//     isRejected: false,
//     rejectionReason: null,
//     likes: null,
//     createdAt: '2024-10-26T06:34:20.213Z',
//     updatedAt: '2024-10-26T06:34:20.213Z',
//     post_type: 'artical',
//   },
//   {
//     _id: '671c8d6c3178858e9e6cada9',
//     title:
//       ' TCS-12 Campus in Vizag: విశాఖలో క్యాంపస్ ఏర్పాటు.. ప్లాన్ మార్చిన టీసీఎస్!.. అక్కడేనా?',
//     content:
//       'ఏపీలోని యువతకు శుభవార్త.. విశాఖపట్నంలో టీసీఎస్ క్యాంపస్ ఏర్పాటుకు వడివడిగా అడుగులు పడుతున్నాయి. టాటా సన్స్ బోర్డు ఛైర్మన్ నటరాజన్ చంద్రశేఖరన్‌తో భేటీ అనంతరం.. ఏపీలో టీసీఎస్ క్యాంపస్ ఏర్పాటు చేయనున్నట్లు ఏపీ ఐటీశాఖ మంత్రి నారా లోకేష్ ప్రకటించిన సంగతి తెలిసిందే. అనంతరం 100 రోజుల్లోనే విశాఖపట్నంలో టీసీఎస్ క్యాంపస్‌కు శంకుస్థాపన చేస్తామని.. నారా లోకేష్ ఇటీవల మరోసారి స్పష్టం చేశారు. ఈ నేపథ్యంలో వైజాగ్‌లో టీసీఎస్ క్యాంపస్ ఏర్పాటు కోసం ప్రయత్నాలు వేగంగా జరుగుతున్నాయి. అయితే వేగంగా టీసీఎస్ క్యాంపస్ ఏర్పాటు చేస్తామని.. కార్యకలాపాలు ప్రారంభిస్తామని నారా లోకేష్ చెప్తున్నారు. ఈ నేపథ్యంలో ఇప్పటికిప్పుడు విశాఖపట్నంలో సొంతంగా భవనాలు నిర్మించడం కష్టం కావున టీసీఎస్ మరో ప్లాన్ అమలు చేస్తున్నట్లు తెలిసింది.\r\n\r\nసొంతంగా భవనాల నిర్మాణం ఇప్పట్లో సాధ్యమయ్యేది కాదు కావున.. భవనాలను అద్దెకు తీసుకోవాలని టీసీఎస్ వర్గాలు భావిస్తున్నట్లు తెలిసింది. ఇందుకోసం పలు ప్రాంతాలను పరిశీలిస్తున్నట్లు సమాచారం. విశాఖలో క్యాంపస్ ఏర్పాటు కోసం లక్ష చదరపు అడుగుల విస్తీర్ణంలో ఆఫీస్ స్పేస్ కావాలని టీసీఎస్ భావిస్తోంది. ఈ నేపథ్యంలోనే రుషికొండ ఐటీ హిల్స్‌లోని మిలీనియం టవర్స్‌లో క్యాంపస్ ఏర్పాటుపై ఆలోచనలు చేస్తున్నట్లు తెలిసింది. ఇది కాకుండా మరో రెండు ప్రైవేటు భవనాలు అద్దె తీసుకునే విషయంపైనా ఆలోచనలు చేస్తున్నట్లు సమాచారం. రుషికొండ ఐటీహిల్స్ మిలీనియం టవర్స్‌లో ఓ భవనం ఖాళీగా ఉంది. ఇదైతే టీసీఎస్ క్యాంపస్ ఏర్పాటుకు సరిగ్గా సరిపోతుందనే ఆలోచన ఉంది',
//     category: 'Technology',
//     imagesList: [],
//     tags: ['#sports', '#cricket', '#News'],
//     user_id: '671c8d6c3178858e9e6cadaa',
//     isPublished: true,
//     isApproved: true,
//     isRejected: false,
//     rejectionReason: null,
//     likes: null,
//     createdAt: '2024-10-26T06:34:20.215Z',
//     updatedAt: '2024-10-26T06:34:20.215Z',
//     post_type: 'artical',
//   },
//   {
//     _id: '671c8d6c3178858e9e6cadab',
//     title:
//       ' TCS-13 Campus in Vizag: విశాఖలో క్యాంపస్ ఏర్పాటు.. ప్లాన్ మార్చిన టీసీఎస్!.. అక్కడేనా?',
//     content:
//       'ఏపీలోని యువతకు శుభవార్త.. విశాఖపట్నంలో టీసీఎస్ క్యాంపస్ ఏర్పాటుకు వడివడిగా అడుగులు పడుతున్నాయి. టాటా సన్స్ బోర్డు ఛైర్మన్ నటరాజన్ చంద్రశేఖరన్‌తో భేటీ అనంతరం.. ఏపీలో టీసీఎస్ క్యాంపస్ ఏర్పాటు చేయనున్నట్లు ఏపీ ఐటీశాఖ మంత్రి నారా లోకేష్ ప్రకటించిన సంగతి తెలిసిందే. అనంతరం 100 రోజుల్లోనే విశాఖపట్నంలో టీసీఎస్ క్యాంపస్‌కు శంకుస్థాపన చేస్తామని.. నారా లోకేష్ ఇటీవల మరోసారి స్పష్టం చేశారు. ఈ నేపథ్యంలో వైజాగ్‌లో టీసీఎస్ క్యాంపస్ ఏర్పాటు కోసం ప్రయత్నాలు వేగంగా జరుగుతున్నాయి. అయితే వేగంగా టీసీఎస్ క్యాంపస్ ఏర్పాటు చేస్తామని.. కార్యకలాపాలు ప్రారంభిస్తామని నారా లోకేష్ చెప్తున్నారు. ఈ నేపథ్యంలో ఇప్పటికిప్పుడు విశాఖపట్నంలో సొంతంగా భవనాలు నిర్మించడం కష్టం కావున టీసీఎస్ మరో ప్లాన్ అమలు చేస్తున్నట్లు తెలిసింది.\r\n\r\nసొంతంగా భవనాల నిర్మాణం ఇప్పట్లో సాధ్యమయ్యేది కాదు కావున.. భవనాలను అద్దెకు తీసుకోవాలని టీసీఎస్ వర్గాలు భావిస్తున్నట్లు తెలిసింది. ఇందుకోసం పలు ప్రాంతాలను పరిశీలిస్తున్నట్లు సమాచారం. విశాఖలో క్యాంపస్ ఏర్పాటు కోసం లక్ష చదరపు అడుగుల విస్తీర్ణంలో ఆఫీస్ స్పేస్ కావాలని టీసీఎస్ భావిస్తోంది. ఈ నేపథ్యంలోనే రుషికొండ ఐటీ హిల్స్‌లోని మిలీనియం టవర్స్‌లో క్యాంపస్ ఏర్పాటుపై ఆలోచనలు చేస్తున్నట్లు తెలిసింది. ఇది కాకుండా మరో రెండు ప్రైవేటు భవనాలు అద్దె తీసుకునే విషయంపైనా ఆలోచనలు చేస్తున్నట్లు సమాచారం. రుషికొండ ఐటీహిల్స్ మిలీనియం టవర్స్‌లో ఓ భవనం ఖాళీగా ఉంది. ఇదైతే టీసీఎస్ క్యాంపస్ ఏర్పాటుకు సరిగ్గా సరిపోతుందనే ఆలోచన ఉంది',
//     category: 'Technology',
//     imagesList: [],
//     tags: ['#sports', '#cricket', '#News'],
//     user_id: '671c8d6c3178858e9e6cadac',
//     isPublished: true,
//     isApproved: true,
//     isRejected: false,
//     rejectionReason: null,
//     likes: null,
//     createdAt: '2024-10-26T06:34:20.216Z',
//     updatedAt: '2024-10-26T06:34:20.216Z',
//     post_type: 'artical',
//   },
// ]
